/**
  ******************************************************************************
  * @file           : drv_adc.c
  * @brief          : ADCドライバー
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "drv.h"

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

/* Exported functions --------------------------------------------------------*/

/**
  * @brief ADCドライバー初期化処理
  * @param None
  * @retval None
  */
void taskAdcDriverInit(void)
{
	/* 処理なし */
}

/**
  * @brief ADCドライバー入力処理
  * @param None
  * @retval None
  */
void taskAdcDriverInput(void)
{
	/* 処理なし */
}

/**
  * @brief ADCドライバー出力処理
  * @param None
  * @retval None
  */
void taskAdcDriverOutput(void)
{
	/* 処理なし */
}

/* Private functions ---------------------------------------------------------*/

