/**
  ******************************************************************************
  * @file           : drv_uart.c
  * @brief          : UARTドライバー
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "drv.h"

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

/* Exported functions --------------------------------------------------------*/

/**
  * @brief UARTドライバー初期化処理
  * @param None
  * @retval None
  */
void taskUartDriverInit(void)
{
	/* 処理なし */
}

/**
  * @brief UARTドライバー入力処理
  * @param None
  * @retval None
  */
void taskUartDriverInput(void)
{
	/* 処理なし */
}

/**
  * @brief UARTドライバー出力処理
  * @param None
  * @retval None
  */
void taskUartDriverOutput(void)
{
	/* 処理なし */
}

/* Private functions ---------------------------------------------------------*/

