/**
  ******************************************************************************
  * @file           : drv_i2c.c
  * @brief          : I2Cドライバー
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "drv.h"

/* Private typedef -----------------------------------------------------------*/

/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/

/* Exported functions --------------------------------------------------------*/

/**
  * @brief I2Cドライバー初期化処理
  * @param None
  * @retval None
  */
void taskI2cDriverInit(void)
{
	/* 処理なし */
}

/**
  * @brief I2Cドライバー入力処理
  * @param None
  * @retval None
  */
void taskI2cDriverInput(void)
{
	/* 処理なし */
}

/**
  * @brief I2Cドライバー出力処理
  * @param None
  * @retval None
  */
void taskI2cDriverOutput(void)
{
	/* 処理なし */
}

/* Private functions ---------------------------------------------------------*/

